In [1]:
import gspread
import pandas as pd
import pymysql.cursors

from sqlalchemy import create_engine

In [2]:
'''Insert money supply data into local mysql database'''

'Insert money supply data into local mysql database'

In [2]:
import MySQLdb as db

In [3]:
service_account = gspread.service_account(filename="/Users/timal/.config/gspread/service_account.json")

In [ ]:
# M0 MONEY SUPPLY

In [4]:
sheet = service_account.open("base_money_supply")
work_sheet = sheet.worksheet("FRED Graph")

In [5]:
all_values = work_sheet.get_all_values()
df = pd.DataFrame(all_values)

In [6]:
df = df.loc[10:]

In [7]:
df.rename(columns=df.iloc[0], inplace = True)
df.drop(df.index[0], inplace = True)
# df['base_money']
df
# df['base_money'] = df['base_money'].apply(lambda x: x * 1000000)

    observation_date base_money
11        1959-01-01      50500
12        1959-02-01      49800
13        1959-03-01      49700
14        1959-04-01      50100
15        1959-05-01      50100
..               ...        ...
766       2021-12-01    6413100
767       2022-01-01    6103900
768       2022-02-01    6040000
769       2022-03-01    6134500
770       2022-04-01    5885200

[760 rows x 2 columns]

In [8]:
df.insert(2, 'scale', 'Millions')

In [9]:
df

    observation_date base_money     scale
11        1959-01-01      50500  Millions
12        1959-02-01      49800  Millions
13        1959-03-01      49700  Millions
14        1959-04-01      50100  Millions
15        1959-05-01      50100  Millions
..               ...        ...       ...
766       2021-12-01    6413100  Millions
767       2022-01-01    6103900  Millions
768       2022-02-01    6040000  Millions
769       2022-03-01    6134500  Millions
770       2022-04-01    5885200  Millions

[760 rows x 3 columns]

In [10]:
df['base_money'] = pd.to_numeric(df['base_money'])

In [11]:
df['observation_date'][11]

'1959-01-01'

In [12]:
df['observation_date'] = pd.to_datetime(df['observation_date'], format='%Y/%m/%d')

In [13]:
df['observation_date'][11]

Timestamp('1959-01-01 00:00:00')

In [15]:
mysql_url = 'mysql://root:root@localhost/macro_data'

engine = create_engine(mysql_url, echo=True)
mysql_connection = engine.connect()
# mysql_connection = pymysql.connect(host='localhost',
#                                    user='root',
#                                    password='root',
#                                    db='macro_data',
#                                    cursorclass=pymysql.cursors.DictCursor)

df[['observation_date','base_money', 'scale']].to_sql(con=mysql_connection, name='us_monthly_base_money_supply', if_exists = 'replace', index=False)

2022-06-07 09:35:38,352 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-06-07 09:35:38,355 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,359 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2022-06-07 09:35:38,360 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,361 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2022-06-07 09:35:38,361 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,378 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %s AND table_name = %s
2022-06-07 09:35:38,379 INFO sqlalchemy.engine.Engine [generated in 0.00078s] ('macro_data', 'us_monthly_base_money_supply')
2022-06-07 09:35:38,399 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %s AND table_name = %s
2022-06-07 09:35:38,399 INFO sqlalchemy.engine.Engine [cached since 0.02152s ago] ('macro_data', 'us_monthly_base_money_supply')
2022-06-07 09:35:38,402 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `macro_data`
2022-06-07 09:35:38,403 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,420 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `us_monthly_base_money_supply`
2022-06-07 09:35:38,420 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,443 INFO sqlalchemy.engine.Engine
DROP TABLE us_monthly_base_money_supply
2022-06-07 09:35:38,443 INFO sqlalchemy.engine.Engine [no key 0.00062s] ()
2022-06-07 09:35:38,454 INFO sqlalchemy.engine.Engine COMMIT
2022-06-07 09:35:38,456 INFO sqlalchemy.engine.Engine
CREATE TABLE us_monthly_base_money_supply (
	observation_date DATETIME,
	base_money BIGINT,
	scale TEXT
)


2022-06-07 09:35:38,456 INFO sqlalchemy.engine.Engine [no key 0.00046s] ()
2022-06-07 09:35:38,477 INFO sqlalchemy.engine.Engine COMMIT
2022-06-07 09:35:38,484 INFO sqlalchemy.engine.Engine INSERT INTO us_monthly_base_money_supply (observation_date, base_money, scale) VALUES (%s, %s, %s)
2022-06-07 09:35:38,484 INFO sqlalchemy.engine.Engine [generated in 0.00257s] ((datetime.datetime(1959, 1, 1, 0, 0), 50500, 'Millions'), (datetime.datetime(1959, 2, 1, 0, 0), 49800, 'Millions'), (datetime.datetime(1959, 3, 1, 0, 0), 49700, 'Millions'), (datetime.datetime(1959, 4, 1, 0, 0), 50100, 'Millions'), (datetime.datetime(1959, 5, 1, 0, 0), 50100, 'Millions'), (datetime.datetime(1959, 6, 1, 0, 0), 50300, 'Millions'), (datetime.datetime(1959, 7, 1, 0, 0), 50800, 'Millions'), (datetime.datetime(1959, 8, 1, 0, 0), 50700, 'Millions')  ... displaying 10 of 760 total bound parameter sets ...  (datetime.datetime(2022, 3, 1, 0, 0), 6134500, 'Millions'), (datetime.datetime(2022, 4, 1, 0, 0), 5885200, 'Millions'))
2022-06-07 09:35:38,509 INFO sqlalchemy.engine.Engine COMMIT

760

In [16]:
# M1 Money Supply

In [19]:
sheet = service_account.open("m1_money_supply")
work_sheet = sheet.worksheet("FRED Graph")
all_values = work_sheet.get_all_values()
df = pd.DataFrame(all_values)

In [21]:
df = df.loc[10:]

In [23]:
df.rename(columns=df.iloc[0], inplace=True)
df.drop(df.index[0], inplace=True)
df

/var/folders/ly/b0d5ymx54rd755r8d506sd000000gn/T/ipykernel_1853/3691051400.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.rename(columns=df.iloc[0], inplace=True)
/var/folders/ly/b0d5ymx54rd755r8d506sd000000gn/T/ipykernel_1853/3691051400.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop(df.index[0], inplace=True)

    observation_date m1_money
11        1959-01-01    138.9
12        1959-02-01    139.4
13        1959-03-01    139.7
14        1959-04-01    139.7
15        1959-05-01    140.7
..               ...      ...
766       2021-12-01  20423.6
767       2022-01-01  20582.3
768       2022-02-01  20667.3
769       2022-03-01  20709.6
770       2022-04-01  20620.5

[760 rows x 2 columns]

In [24]:
df.insert(2, 'scale', 'Billions')
df

    observation_date m1_money     scale
11        1959-01-01    138.9  Billions
12        1959-02-01    139.4  Billions
13        1959-03-01    139.7  Billions
14        1959-04-01    139.7  Billions
15        1959-05-01    140.7  Billions
..               ...      ...       ...
766       2021-12-01  20423.6  Billions
767       2022-01-01  20582.3  Billions
768       2022-02-01  20667.3  Billions
769       2022-03-01  20709.6  Billions
770       2022-04-01  20620.5  Billions

[760 rows x 3 columns]

In [26]:
df['m1_money'] = pd.to_numeric(df['m1_money'])
df

/var/folders/ly/b0d5ymx54rd755r8d506sd000000gn/T/ipykernel_1853/3904327539.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['m1_money'] = pd.to_numeric(df['m1_money'])

    observation_date  m1_money     scale
11        1959-01-01     138.9  Billions
12        1959-02-01     139.4  Billions
13        1959-03-01     139.7  Billions
14        1959-04-01     139.7  Billions
15        1959-05-01     140.7  Billions
..               ...       ...       ...
766       2021-12-01   20423.6  Billions
767       2022-01-01   20582.3  Billions
768       2022-02-01   20667.3  Billions
769       2022-03-01   20709.6  Billions
770       2022-04-01   20620.5  Billions

[760 rows x 3 columns]

In [27]:
df['observation_date'] = pd.to_datetime(df['observation_date'], format='%Y/%m/%d')

/var/folders/ly/b0d5ymx54rd755r8d506sd000000gn/T/ipykernel_1853/1389386130.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['observation_date'] = pd.to_datetime(df['observation_date'], format='%Y/%m/%d')

In [28]:
df['observation_date'][11]

Timestamp('1959-01-01 00:00:00')

In [31]:
mysql_url = 'mysql://root:root@localhost/macro_data'

engine = create_engine(mysql_url, echo=True)
mysql_connection = engine.connect()

2022-06-07 09:54:34,171 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-06-07 09:54:34,175 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:54:34,178 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2022-06-07 09:54:34,178 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:54:34,180 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2022-06-07 09:54:34,180 INFO sqlalchemy.engine.Engine [raw sql] ()

In [32]:
df[['observation_date','m1_money', 'scale']].to_sql(con=mysql_connection, name='us_monthly_m1_money_supply', if_exists = 'replace', index=False)

2022-06-07 09:54:35,281 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %s AND table_name = %s
2022-06-07 09:54:35,282 INFO sqlalchemy.engine.Engine [generated in 0.00172s] ('macro_data', 'us_monthly_m1_money_supply')
2022-06-07 09:54:35,293 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %s AND table_name = %s
2022-06-07 09:54:35,294 INFO sqlalchemy.engine.Engine [cached since 0.01329s ago] ('macro_data', 'us_monthly_m1_money_supply')
2022-06-07 09:54:35,296 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `macro_data`
2022-06-07 09:54:35,296 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:54:35,302 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `us_monthly_m1_money_supply`
2022-06-07 09:54:35,303 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:54:35,315 INFO sqlalchemy.engine.Engine
DROP TABLE us_monthly_m1_money_supply
2022-06-07 09:54:35,316 INFO sqlalchemy.engine.Engine [no key 0.00065s] ()
2022-06-07 09:54:35,325 INFO sqlalchemy.engine.Engine COMMIT
2022-06-07 09:54:35,327 INFO sqlalchemy.engine.Engine
CREATE TABLE us_monthly_m1_money_supply (
	observation_date DATETIME,
	m1_money FLOAT(53),
	scale TEXT
)


2022-06-07 09:54:35,327 INFO sqlalchemy.engine.Engine [no key 0.00052s] ()
2022-06-07 09:54:35,339 INFO sqlalchemy.engine.Engine COMMIT
2022-06-07 09:54:35,345 INFO sqlalchemy.engine.Engine INSERT INTO us_monthly_m1_money_supply (observation_date, m1_money, scale) VALUES (%s, %s, %s)
2022-06-07 09:54:35,345 INFO sqlalchemy.engine.Engine [generated in 0.00267s] ((datetime.datetime(1959, 1, 1, 0, 0), 138.9, 'Billions'), (datetime.datetime(1959, 2, 1, 0, 0), 139.4, 'Billions'), (datetime.datetime(1959, 3, 1, 0, 0), 139.7, 'Billions'), (datetime.datetime(1959, 4, 1, 0, 0), 139.7, 'Billions'), (datetime.datetime(1959, 5, 1, 0, 0), 140.7, 'Billions'), (datetime.datetime(1959, 6, 1, 0, 0), 141.2, 'Billions'), (datetime.datetime(1959, 7, 1, 0, 0), 141.7, 'Billions'), (datetime.datetime(1959, 8, 1, 0, 0), 141.9, 'Billions')  ... displaying 10 of 760 total bound parameter sets ...  (datetime.datetime(2022, 3, 1, 0, 0), 20709.6, 'Billions'), (datetime.datetime(2022, 4, 1, 0, 0), 20620.5, 'Billions'))
2022-06-07 09:54:35,369 INFO sqlalchemy.engine.Engine COMMIT

760

In [33]:
# M2 MONEY SUPPLY

In [34]:
sheet = service_account.open("m2_money_supply")
work_sheet = sheet.worksheet("FRED Graph")
all_values = work_sheet.get_all_values()
df = pd.DataFrame(all_values)

In [35]:
df = df.loc[10:]

In [36]:
df.rename(columns=df.iloc[0], inplace=True)
df.drop(df.index[0], inplace=True)
df

     observation_date m2_money
11         1980-11-03   1595.2
12         1980-11-10   1601.2
13         1980-11-17   1602.9
14         1980-11-24   1594.8
15         1980-12-01   1599.8
...               ...      ...
2172       2022-04-04  22069.6
2173       2022-04-11  22059.2
2174       2022-04-18  22136.9
2175       2022-04-25  21690.4
2176       2022-05-02  21696.8

[2166 rows x 2 columns]

In [37]:
df.insert(2, 'scale', 'Billions')
df

     observation_date m2_money     scale
11         1980-11-03   1595.2  Billions
12         1980-11-10   1601.2  Billions
13         1980-11-17   1602.9  Billions
14         1980-11-24   1594.8  Billions
15         1980-12-01   1599.8  Billions
...               ...      ...       ...
2172       2022-04-04  22069.6  Billions
2173       2022-04-11  22059.2  Billions
2174       2022-04-18  22136.9  Billions
2175       2022-04-25  21690.4  Billions
2176       2022-05-02  21696.8  Billions

[2166 rows x 3 columns]

In [38]:
df['m2_money'] = pd.to_numeric(df['m2_money'])
df['observation_date'] = pd.to_datetime(df['observation_date'], format='%Y/%m/%d')

In [39]:
mysql_url = 'mysql://root:root@localhost/macro_data'

engine = create_engine(mysql_url, echo=True)
mysql_connection = engine.connect()
# mysql_connection = pymysql.connect(host='localhost',
#                                    user='root',
#                                    password='root',
#                                    db='macro_data',
#                                    cursorclass=pymysql.cursors.DictCursor)

df[['observation_date','m2_money', 'scale']].to_sql(con=mysql_connection, name='us_weekly_m2_money_supply', if_exists = 'replace', index=False)

2022-06-07 10:00:39,757 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-06-07 10:00:39,758 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 10:00:39,764 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2022-06-07 10:00:39,764 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 10:00:39,766 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2022-06-07 10:00:39,767 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 10:00:39,782 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %s AND table_name = %s
2022-06-07 10:00:39,783 INFO sqlalchemy.engine.Engine [generated in 0.00155s] ('macro_data', 'us_weekly_m2_money_supply')
2022-06-07 10:00:39,795 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %s AND table_name = %s
2022-06-07 10:00:39,795 INFO sqlalchemy.engine.Engine [cached since 0.01415s ago] ('macro_data', 'us_weekly_m2_money_supply')
2022-06-07 10:00:39,800 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `macro_data`
2022-06-07 10:00:39,800 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 10:00:39,803 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `us_weekly_m2_money_supply`
2022-06-07 10:00:39,803 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 10:00:39,809 INFO sqlalchemy.engine.Engine
DROP TABLE us_weekly_m2_money_supply
2022-06-07 10:00:39,810 INFO sqlalchemy.engine.Engine [no key 0.00062s] ()
2022-06-07 10:00:39,825 INFO sqlalchemy.engine.Engine COMMIT
2022-06-07 10:00:39,826 INFO sqlalchemy.engine.Engine
CREATE TABLE us_weekly_m2_money_supply (
	observation_date DATETIME,
	m2_money FLOAT(53),
	scale TEXT
)


2022-06-07 10:00:39,827 INFO sqlalchemy.engine.Engine [no key 0.00058s] ()
2022-06-07 10:00:39,837 INFO sqlalchemy.engine.Engine COMMIT
2022-06-07 10:00:39,850 INFO sqlalchemy.engine.Engine INSERT INTO us_weekly_m2_money_supply (observation_date, m2_money, scale) VALUES (%s, %s, %s)
2022-06-07 10:00:39,850 INFO sqlalchemy.engine.Engine [generated in 0.00674s] ((datetime.datetime(1980, 11, 3, 0, 0), 1595.2, 'Billions'), (datetime.datetime(1980, 11, 10, 0, 0), 1601.2, 'Billions'), (datetime.datetime(1980, 11, 17, 0, 0), 1602.9, 'Billions'), (datetime.datetime(1980, 11, 24, 0, 0), 1594.8, 'Billions'), (datetime.datetime(1980, 12, 1, 0, 0), 1599.8, 'Billions'), (datetime.datetime(1980, 12, 8, 0, 0), 1605.3, 'Billions'), (datetime.datetime(1980, 12, 15, 0, 0), 1606.3, 'Billions'), (datetime.datetime(1980, 12, 22, 0, 0), 1602.5, 'Billions')  ... displaying 10 of 2166 total bound parameter sets ...  (datetime.datetime(2022, 4, 25, 0, 0), 21690.4, 'Billions'), (datetime.datetime(2022, 5, 2, 0, 0), 21696.8, 'Billions'))
2022-06-07 10:00:39,899 INFO sqlalchemy.engine.Engine COMMIT

2166